:orange_circle:
```
sudo docker compose run --rm devops-utils sh -c 'cd components/test-vpc; terraform plan -no-color -var-file="../../accounts/infrastructure/network/var.tfvars"'
module.identity.aws_iam_role_policy_attachment.SSM-role-policy-attach: Refreshing state... [id=ssm-arthur-20250201124320774300000001]
module.identity.aws_iam_role.ssm_role: Refreshing state... [id=ssm-arthur]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-07a35b024555ea00e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.identity.aws_iam_role.ssm_role will be destroyed
  # (because aws_iam_role.ssm_role is not in configuration)
  - resource "aws_iam_role" "ssm_role" {
      - arn                   = "arn:aws:iam::722141136946:role/ssm-arthur" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-02-01T12:43:20Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ssm-arthur" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ssm-arthur" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {
          - "Owner" = "arthur"
        } -> null
      - tags_all              = {
          - "Owner" = "arthur"
        } -> null
      - unique_id             = "AROA2QIXXJAZCYJZ44CMH" -> null
    }

  # module.identity.aws_iam_role_policy_attachment.SSM-role-policy-attach will be destroyed
  # (because aws_iam_role_policy_attachment.SSM-role-policy-attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "SSM-role-policy-attach" {
      - id         = "ssm-arthur-20250201124320774300000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "ssm-arthur" -> null
    }

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"  = "devops-igw"
          + "Owner" = "arthur"
        }
      + tags_all = {
          + "Name"  = "devops-igw"
          + "Owner" = "arthur"
        }
      + vpc_id   = "vpc-07a35b024555ea00e"
    }

  # module.vpc.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"  = "devops-vpc-public-rt"
          + "Owner" = "arthur"
        }
      + tags_all         = {
          + "Name"  = "devops-vpc-public-rt"
          + "Owner" = "arthur"
        }
      + vpc_id           = "vpc-07a35b024555ea00e"
    }

  # module.vpc.aws_route_table_association.public_asso[0] will be created
  + resource "aws_route_table_association" "public_asso" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_asso[1] will be created
  + resource "aws_route_table_association" "public_asso" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_asso[2] will be created
  + resource "aws_route_table_association" "public_asso" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.allow_SSH_HTTP will be created
  + resource "aws_security_group" "allow_SSH_HTTP" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All Traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "Self SG"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "allow_SSH_HTTP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_SSH_HTTP"
        }
      + tags_all               = {
          + "Name" = "allow_SSH_HTTP"
        }
      + vpc_id                 = "vpc-07a35b024555ea00e"
    }

  # module.vpc.module.tier["public_subnet"].aws_subnet.this[0] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "devops-vpc-public_subnet-a"
          + "Owner" = "arthur"
        }
      + tags_all                                       = {
          + "Name"  = "devops-vpc-public_subnet-a"
          + "Owner" = "arthur"
        }
      + vpc_id                                         = "vpc-07a35b024555ea00e"
    }

  # module.vpc.module.tier["public_subnet"].aws_subnet.this[1] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "devops-vpc-public_subnet-b"
          + "Owner" = "arthur"
        }
      + tags_all                                       = {
          + "Name"  = "devops-vpc-public_subnet-b"
          + "Owner" = "arthur"
        }
      + vpc_id                                         = "vpc-07a35b024555ea00e"
    }

  # module.vpc.module.tier["public_subnet"].aws_subnet.this[2] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "devops-vpc-public_subnet-c"
          + "Owner" = "arthur"
        }
      + tags_all                                       = {
          + "Name"  = "devops-vpc-public_subnet-c"
          + "Owner" = "arthur"
        }
      + vpc_id                                         = "vpc-07a35b024555ea00e"
    }

Plan: 9 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```